# -*- coding: utf-8 -*-

Plugin.create(:mikutter_inmu) do
  command(
          :mikutter_inmu,
          name: '淫夢',
          condition: lambda{ |opt| true },
          visible: true,
          role: :timeline
          ) do |opt|
    to_name = opt.messages[0].user.idname
    greets = ["FF外から失礼するゾ〜 ",
              "このツイート面白スギィ!!!!!",
              "自分、RTいいっすか？",
              "淫語知ってそうだから淫夢のリストにぶち込んでやるぜー ",
              "いきなりリプしてすみません！許してください！",
              "なんでもしますから！",
              "あのさぁ……",
              "(なんでもするとは言ってない)",
              "いいっすね〜",
              "たまらねぇぜ ",
              "いいゾ〜これ ",
              "うん、おいしい！", "見たけりゃ見せてやるよ ",
              "ああ＾〜", "パパパッとイッて、終わりっ！",
              "当たり前だよなぁ？", "まぁ多少はね？",
              "あーあもう滅茶苦茶だよ", "豚ァ！",
              "お前のことが好きだったんだよ ",
              "申し訳ないが昼はNG ", "やべぇよやべぇよ ",
              "おまたせ ", "ぬわああああん疲れたもおおおおん ",
              "おじさんだと！ふざけんじゃねえよお前！お兄さんだろぉ！？",
              "おじさんのこと本気で怒らせちゃったね ", "ハイ、ヨロシクゥ！",
              "はい、よーいスタート ", "ふざけんな！", "ほんとぉ？",
              "おじさんやめちくり～ ", "お前ここは初めてか？",
              "オッスお願いしまーす！", "三十分で、五万！",
              "おっ、そうだな ", "悲しいなぁ……", "何だこのオッサン！？",
              "彼女とか、いらっしゃらないんですか？", "やったぜ。",
              "こ↑こ↓", "そうだよ ", "違うだろ！いい加減にしろ！",
              "先輩！何してんすか！やめてくださいよ本当に！",
              "勉強になりましたあざーした！"]
    postfix = ["！", "…", "(冷静)", "(謝罪)", "(絶望)", "(良心)",
               "どうぞ(合言葉)", "ないです ", "(威圧)", "(嘲笑)",
               "馬鹿野郎お前俺は勝つぞお前 ", "ファッ！？",
               "(声だけ迫真)", "(震え声)", "ンアーッ！",
               "ありがとナス！", "(ドン引き)", "(青春)", "力抜けよ　",
               "(嫌々)", "かしこまり！", "(戒め)", "(便乗)", "(王者の風格)"]

    n_msg = ""
    msg = "@"+to_name + " "
    greets.shuffle!
    postfix.shuffle!
    while TRUE do
      n_msg = greets.pop
      n_msg += postfix.pop
      break if msg.split(//).size + n_msg.split(//).size >= 140
      msg += n_msg
    end
    Service.primary.post(:message => msg,
                         :replyto => opt.messages[0])
  end
end
